<a href="https://colab.research.google.com/github/Aravind333-creator/python-notes/blob/main/pandas__notes_B7.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
#what is pandas?
#pandas is a open source library, mainly works with relational or labelled data base
#why we are using this pandas?
#fast, high-performance,and productive
#easy to load the data
#easy to insert and delete the columns
#flxible reshaping and pivoting the data
#time series analysis
#data visualisation
#group by functionality
#what is difference between excel and pandas?
#

In [ ]:
#pandas is more advanced than advanced excel
#pandas--> Mc kineey--->2008

In [ ]:
#what is the functions of pandas?
#Analysing, cleaning, exploring, manipulating the data

In [ ]:
#what is Data cleaning?
#delete irrelevent rows/ wrong values, empty or null values, correction of data types,duplicates...etc

In [ ]:
#Installation of pandas
!pip install pandas

Requirement already satisfied: pandas in c:\users\mopedo electric\appdata\local\programs\python\python313\lib\site-packages (2.2.3)
Requirement already satisfied: numpy>=1.26.0 in c:\users\mopedo electric\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.2.1)
Requirement already satisfied: python-dateutil>=2.8.2 in c:\users\mopedo electric\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in c:\users\mopedo electric\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: tzdata>=2022.7 in c:\users\mopedo electric\appdata\local\programs\python\python313\lib\site-packages (from pandas) (2024.2)
Requirement already satisfied: six>=1.5 in c:\users\mopedo electric\appdata\local\programs\python\python313\lib\site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)

In [ ]:
import pandas as pd

In [ ]:
#how many types of data structures do we have in pandas
#there are 3 types
#1d-->series
#2d--> DataFrame
#3--> Panel

In [ ]:
#1D-->Series:-
"""series are 1D labelled array which holds-->int,float,str,object

In [ ]:
import numpy as np
a = np.array([1,2,3,4])
print(a)

[1 2 3 4]

In [ ]:
#change the above array into series
sr = pd.Series(a)
print(sr)

0    1
1    2
2    3
3    4
dtype: int64

In [ ]:
#how can we change the labels?
sr = pd.Series(a,index=['a','b','c','d'])
print(sr)

a    1
b    2
c    3
d    4
dtype: int64

In [ ]:
#create a series from dictionary?
d = {
    'name':'shah',
    'occupation':'DS',
    'address':'Hyderabad'
}
sr = pd.Series(d)
print(sr)
print(type(sr))

name               shah
occupation           DS
address       Hyderabad
dtype: object
<class 'pandas.core.series.Series'>

In [ ]:
#How can we represent a Series in Pandas?
#<class 'pandas.core.series.Series'>

In [ ]:
#create series from list,tuple and set?-->H.W

In [ ]:
#Note:- we cannot create a series from set  why beacuase sets are unordered
#How can we create a series?
#pd.Series('collection_name')

In [ ]:
#DataFrame
#what is DataFrame?
"""2D-->size, mutable, heterogenous data with labelled axis(rows and columns)
#cols:- is also known as "features,varaibles,fields,dimensions"
#rows:- is also known as "records,values,index"

In [ ]:
#what is applications of DF?
"""works on datasets
   analysis
   dropping
   processing
   cleaning
   join the multiple data
   create excel,json,csv,binary files..etc
   compute mathmetical and statistical operations
   use groupby functions"""

In [ ]:
#create a df from list of numbers
a = [1,2,3,4,5,6]
df = pd.DataFrame(a)
print(df)

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [ ]:
#create a data freame from tuple,set and dictioanry-->H.w?

In [ ]:
#importing and exporting the DF
#1.csv:- comma,seprate,value
#read a csv file by using the pandas?
df = pd.read_csv("Sales_November_2019.csv")
print(df)
#convert or export the df in to excel format
new = pd.ExcelWriter('sample.xlsx',index=False)
df.to_excel(new)
new.save()

      Order ID                     Product Quantity Ordered Price Each  \
0       278797            Wired Headphones                1      11.99
1       278798        USB-C Charging Cable                2      11.95
2       278799    Apple Airpods Headphones                1      150.0
3       278800            27in FHD Monitor                1     149.99
4       278801  Bose SoundSport Headphones                1      99.99
...        ...                         ...              ...        ...
17656   295660      AAA Batteries (4-pack)                2       2.99
17657   295661        USB-C Charging Cable                1      11.95
17658   295662    Lightning Charging Cable                1      14.95
17659   295663      AAA Batteries (4-pack)                1       2.99
17660   295664                Google Phone                1        600

           Order Date                      Purchase Address
0      11/21/19 09:54   46 Park St, New York City, NY 10001
1      11/17/19 10:03      962 Hickory St, Austin, TX 73301
2      11/19/19 14:56  464 Cherry St, Los Angeles, CA 90001
3      11/25/19 22:24        649 10th St, Seattle, WA 98101
4      11/09/19 13:56         522 Hill St, Boston, MA 02215
...               ...                                   ...
17656  11/04/19 14:17     574 4th St, Los Angeles, CA 90001
17657  11/23/19 07:22          359 1st St, Austin, TX 73301
17658  11/13/19 16:12         900 10th St, Boston, MA 02215
17659  11/17/19 17:08       592 Sunset St, Boston, MA 02215
17660  11/17/19 16:13      428 Jackson St, Boston, MA 02215

[17661 rows x 6 columns]

TypeError: ExcelWriter.__new__() got an unexpected keyword argument 'index'

In [ ]:
import pandas as pd
df = pd.read_csv("Sales_November_2019.csv")
print(df)
#export or convert above df to json format
df.to_json('sample.json')

      Order ID                     Product Quantity Ordered Price Each  \
0       278797            Wired Headphones                1      11.99
1       278798        USB-C Charging Cable                2      11.95
2       278799    Apple Airpods Headphones                1      150.0
3       278800            27in FHD Monitor                1     149.99
4       278801  Bose SoundSport Headphones                1      99.99
...        ...                         ...              ...        ...
17656   295660      AAA Batteries (4-pack)                2       2.99
17657   295661        USB-C Charging Cable                1      11.95
17658   295662    Lightning Charging Cable                1      14.95
17659   295663      AAA Batteries (4-pack)                1       2.99
17660   295664                Google Phone                1        600

           Order Date                      Purchase Address
0      11/21/19 09:54   46 Park St, New York City, NY 10001
1      11/17/19 10:03      962 Hickory St, Austin, TX 73301
2      11/19/19 14:56  464 Cherry St, Los Angeles, CA 90001
3      11/25/19 22:24        649 10th St, Seattle, WA 98101
4      11/09/19 13:56         522 Hill St, Boston, MA 02215
...               ...                                   ...
17656  11/04/19 14:17     574 4th St, Los Angeles, CA 90001
17657  11/23/19 07:22          359 1st St, Austin, TX 73301
17658  11/13/19 16:12         900 10th St, Boston, MA 02215
17659  11/17/19 17:08       592 Sunset St, Boston, MA 02215
17660  11/17/19 16:13      428 Jackson St, Boston, MA 02215

[17661 rows x 6 columns]

In [ ]:
#Data Frame function\
#read the sample.json file
df2 = pd.read_json('sample.json')
df2

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,278797,Wired Headphones,1,11.99,11/21/19 09:54,"46 Park St, New York City, NY 10001"
1,278798,USB-C Charging Cable,2,11.95,11/17/19 10:03,"962 Hickory St, Austin, TX 73301"
2,278799,Apple Airpods Headphones,1,150.0,11/19/19 14:56,"464 Cherry St, Los Angeles, CA 90001"
3,278800,27in FHD Monitor,1,149.99,11/25/19 22:24,"649 10th St, Seattle, WA 98101"
4,278801,Bose SoundSport Headphones,1,99.99,11/09/19 13:56,"522 Hill St, Boston, MA 02215"
...,...,...,...,...,...,...
17656,295660,AAA Batteries (4-pack),2,2.99,11/04/19 14:17,"574 4th St, Los Angeles, CA 90001"
17657,295661,USB-C Charging Cable,1,11.95,11/23/19 07:22,"359 1st St, Austin, TX 73301"
17658,295662,Lightning Charging Cable,1,14.95,11/13/19 16:12,"900 10th St, Boston, MA 02215"
17659,295663,AAA Batteries (4-pack),1,2.99,11/17/19 17:08,"592 Sunset St, Boston, MA 02215"
17660,295664,Google Phone,1,600,11/17/19 16:13,"428 Jackson St, Boston, MA 02215"

In [ ]:
#check the size and index of you df
df.size    #--> No of rows * no of columns

105966

In [ ]:
#find the range of index
df.index

RangeIndex(start=0, stop=17661, step=1)

In [ ]:
#find the columns in your df
df.columns

Index(['Order ID', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date',
       'Purchase Address'],
      dtype='object')

In [ ]:
#how can i get the overall information of my dataset
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17661 entries, 0 to 17660
Data columns (total 6 columns):
 #   Column            Non-Null Count  Dtype
---  ------            --------------  -----
 0   Order ID          17616 non-null  object
 1   Product           17616 non-null  object
 2   Quantity Ordered  17616 non-null  object
 3   Price Each        17616 non-null  object
 4   Order Date        17616 non-null  object
 5   Purchase Address  17616 non-null  object
dtypes: object(6)
memory usage: 828.0+ KB

In [ ]:
#find the data types of the df
df.dtypes

Order ID            object
Product             object
Quantity Ordered    object
Price Each          object
Order Date          object
Purchase Address    object
dtype: object

In [ ]:
#from the overall information of the dataset we have seen that some columns are having mis matched dtypes
#In Above df  , Quantity Ordered, Price Each, Date,

In [ ]:
#how to describe the overall data
df.describe()

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
count,17616,17616,17616,17616,17616,17616
unique,16869,20,9,24,13197,16492
top,Order ID,USB-C Charging Cable,1,11.95,Order Date,Purchase Address
freq,36,2062,15925,2062,36,36

In [ ]:
#i want to check the last 10 rows in my df
df.tail()  #By default df.tail() prints last 5 rows

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
17656,295660,AAA Batteries (4-pack),2,2.99,11/04/19 14:17,"574 4th St, Los Angeles, CA 90001"
17657,295661,USB-C Charging Cable,1,11.95,11/23/19 07:22,"359 1st St, Austin, TX 73301"
17658,295662,Lightning Charging Cable,1,14.95,11/13/19 16:12,"900 10th St, Boston, MA 02215"
17659,295663,AAA Batteries (4-pack),1,2.99,11/17/19 17:08,"592 Sunset St, Boston, MA 02215"
17660,295664,Google Phone,1,600,11/17/19 16:13,"428 Jackson St, Boston, MA 02215"

In [ ]:
df.tail(10)
#Note if you want specific number of rows give number in the function or paranthesis

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
17651,295655,Wired Headphones,1,11.99,11/10/19 10:39,"246 Ridge St, New York City, NY 10001"
17652,295656,Wired Headphones,1,11.99,11/04/19 16:26,"320 Pine St, Atlanta, GA 30301"
17653,295657,AA Batteries (4-pack),1,3.84,11/02/19 18:29,"596 Cherry St, Atlanta, GA 30301"
17654,295658,Google Phone,1,600,11/17/19 13:37,"949 River St, San Francisco, CA 94016"
17655,295659,AA Batteries (4-pack),3,3.84,11/22/19 20:07,"173 11th St, San Francisco, CA 94016"
17656,295660,AAA Batteries (4-pack),2,2.99,11/04/19 14:17,"574 4th St, Los Angeles, CA 90001"
17657,295661,USB-C Charging Cable,1,11.95,11/23/19 07:22,"359 1st St, Austin, TX 73301"
17658,295662,Lightning Charging Cable,1,14.95,11/13/19 16:12,"900 10th St, Boston, MA 02215"
17659,295663,AAA Batteries (4-pack),1,2.99,11/17/19 17:08,"592 Sunset St, Boston, MA 02215"
17660,295664,Google Phone,1,600,11/17/19 16:13,"428 Jackson St, Boston, MA 02215"

In [ ]:
#check the null values present in the df or not?
df.isna() #df.isna() returns the o/p in boolean form(true if present, false if not present null values)
df.isnull() #df.isnull() returns the o/p in boolean form(true if present, false if not present null values)

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,False,False,False,False,False,False
1,False,False,False,False,False,False
2,False,False,False,False,False,False
3,False,False,False,False,False,False
4,False,False,False,False,False,False
...,...,...,...,...,...,...
17656,False,False,False,False,False,False
17657,False,False,False,False,False,False
17658,False,False,False,False,False,False
17659,False,False,False,False,False,False
17660,False,False,False,False,False,False

In [ ]:
#find the sum of null values
df.isnull().sum()

Order ID            45
Product             45
Quantity Ordered    45
Price Each          45
Order Date          45
Purchase Address    45
dtype: int64

In [ ]:
#print the rows  where the null values are present
null = df[df.isnull().any(axis=1)]
null

      Order ID Product Quantity Ordered Price Each Order Date Purchase Address
69         NaN     NaN              NaN        NaN        NaN              NaN
138        NaN     NaN              NaN        NaN        NaN              NaN
544        NaN     NaN              NaN        NaN        NaN              NaN
546        NaN     NaN              NaN        NaN        NaN              NaN
781        NaN     NaN              NaN        NaN        NaN              NaN
1853       NaN     NaN              NaN        NaN        NaN              NaN
1986       NaN     NaN              NaN        NaN        NaN              NaN
2087       NaN     NaN              NaN        NaN        NaN              NaN
2093       NaN     NaN              NaN        NaN        NaN              NaN
2621       NaN     NaN              NaN        NaN        NaN              NaN
3297       NaN     NaN              NaN        NaN        NaN              NaN
3927       NaN     NaN              NaN        NaN        NaN              NaN
4442       NaN     NaN              NaN        NaN        NaN              NaN
5912       NaN     NaN              NaN        NaN        NaN              NaN
6126       NaN     NaN              NaN        NaN        NaN              NaN
6487       NaN     NaN              NaN        NaN        NaN              NaN
7059       NaN     NaN              NaN        NaN        NaN              NaN
7631       NaN     NaN              NaN        NaN        NaN              NaN
7646       NaN     NaN              NaN        NaN        NaN              NaN
7670       NaN     NaN              NaN        NaN        NaN              NaN
8380       NaN     NaN              NaN        NaN        NaN              NaN
8674       NaN     NaN              NaN        NaN        NaN              NaN
11002      NaN     NaN              NaN        NaN        NaN              NaN
11183      NaN     NaN              NaN        NaN        NaN              NaN
11286      NaN     NaN              NaN        NaN        NaN              NaN
11584      NaN     NaN              NaN        NaN        NaN              NaN
11619      NaN     NaN              NaN        NaN        NaN              NaN
11904      NaN     NaN              NaN        NaN        NaN              NaN
12194      NaN     NaN              NaN        NaN        NaN              NaN
12487      NaN     NaN              NaN        NaN        NaN              NaN
13072      NaN     NaN              NaN        NaN        NaN              NaN
13488      NaN     NaN              NaN        NaN        NaN              NaN
13603      NaN     NaN              NaN        NaN        NaN              NaN
13695      NaN     NaN              NaN        NaN        NaN              NaN
14159      NaN     NaN              NaN        NaN        NaN              NaN
15283      NaN     NaN              NaN        NaN        NaN              NaN
15941      NaN     NaN              NaN        NaN        NaN              NaN
16327      NaN     NaN              NaN        NaN        NaN              NaN
16746      NaN     NaN              NaN        NaN        NaN              NaN
16763      NaN     NaN              NaN        NaN        NaN              NaN
16771      NaN     NaN              NaN        NaN        NaN              NaN
16947      NaN     NaN              NaN        NaN        NaN              NaN
17227      NaN     NaN              NaN        NaN        NaN              NaN
17464      NaN     NaN              NaN        NaN        NaN              NaN
17469      NaN     NaN              NaN        NaN        NaN              NaN

In [ ]:
#how can we drop the null values?
df.dropna(inplace=True)
#df.dropna(inplace=True, subset= df['column name'])

In [ ]:
#check for null values
df.isnull().sum()

Order ID            0
Product             0
Quantity Ordered    0
Price Each          0
Order Date          0
Purchase Address    0
dtype: int64

In [ ]:
#df.index-->start end step range of indexs of your df
#df.size--> row*col
#df.columns-->print the columns
#df.info()-->to get the overall information
#df.dtypes---->to,print dtypes
#df.describe---> to print the descriptive stats of your df
#df.tail()--->to print last rows
#df.isna() or df.isnull()--> returns the boolean o/p
#df.isnull().sum()-->prints overall sum of data
#df.dropna()--> drop the null values

In [ ]:
###Accessing the DF
df.columns

Index(['Order ID', 'Product', 'Quantity Ordered', 'Price Each', 'Order Date',
       'Purchase Address'],
      dtype='object')

In [ ]:
#read or access the column quantity order
df['Quantity Ordered']

0        1
1        2
2        1
3        1
4        1
        ..
17656    2
17657    1
17658    1
17659    1
17660    1
Name: Quantity Ordered, Length: 17616, dtype: object

In [ ]:
#read the 1st 5 rows of df
df.head()#by default it print first 5 rows

,Order ID,Product,Quantity Ordered,Price Each,Order Date,Purchase Address
0,278797,Wired Headphones,1,11.99,11/21/19 09:54,"46 Park St, New York City, NY 10001"
1,278798,USB-C Charging Cable,2,11.95,11/17/19 10:03,"962 Hickory St, Austin, TX 73301"
2,278799,Apple Airpods Headphones,1,150.0,11/19/19 14:56,"464 Cherry St, Los Angeles, CA 90001"
3,278800,27in FHD Monitor,1,149.99,11/25/19 22:24,"649 10th St, Seattle, WA 98101"
4,278801,Bose SoundSport Headphones,1,99.99,11/09/19 13:56,"522 Hill St, Boston, MA 02215"

In [ ]:
df.head(10) #to read the 1st 10 rows

In [ ]:
#access the product column with 1st 5 rows
df['Product'].head()

0              Wired Headphones
1          USB-C Charging Cable
2      Apple Airpods Headphones
3              27in FHD Monitor
4    Bose SoundSport Headphones
Name: Product, dtype: object

In [ ]:
#print 1st value of the column Purchase order
df['Purchase Address'][0]

'46 Park St, New York City, NY 10001'

In [ ]:
#read the multiple columns at a time
df[['Purchase Address','Product','Quantity Ordered']]

,Purchase Address,Product,Quantity Ordered
0,"46 Park St, New York City, NY 10001",Wired Headphones,1
1,"962 Hickory St, Austin, TX 73301",USB-C Charging Cable,2
2,"464 Cherry St, Los Angeles, CA 90001",Apple Airpods Headphones,1
3,"649 10th St, Seattle, WA 98101",27in FHD Monitor,1
4,"522 Hill St, Boston, MA 02215",Bose SoundSport Headphones,1
...,...,...,...
17656,"574 4th St, Los Angeles, CA 90001",AAA Batteries (4-pack),2
17657,"359 1st St, Austin, TX 73301",USB-C Charging Cable,1
17658,"900 10th St, Boston, MA 02215",Lightning Charging Cable,1
17659,"592 Sunset St, Boston, MA 02215",AAA Batteries (4-pack),1
17660,"428 Jackson St, Boston, MA 02215",Google Phone,1

In [ ]:
#22-01-2025
import pandas as pd

In [ ]:
df = pd.read_csv('Diabetes Missing Data.csv')

In [ ]:
#access the df
#read the 1st 5 rows of your df
df.head()

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1

In [ ]:
df.columns

Index(['Pregnant', 'Glucose', 'Diastolic_BP', 'Skin_Fold', 'Serum_Insulin',
       'BMI', 'Diabetes_Pedigree', 'Age', 'Class'],
      dtype='object')

In [ ]:
#find the number of rows and columns in df
df.shape

(768, 9)

In [ ]:
#access the paricular column data
df['Glucose']

0      148.0
1       85.0
2      183.0
3       89.0
4      137.0
       ...
763    101.0
764    122.0
765    121.0
766    126.0
767     93.0
Name: Glucose, Length: 768, dtype: float64

In [ ]:
#access multiple columns at a time
df[['Glucose','BMI']]

     Glucose   BMI
0      148.0  33.6
1       85.0  26.6
2      183.0  23.3
3       89.0  28.1
4      137.0  43.1
..       ...   ...
763    101.0  32.9
764    122.0  36.8
765    121.0  26.2
766    126.0  30.1
767     93.0  30.4

[768 rows x 2 columns]

In [ ]:
#read the 1st 5 rows of BMI
df['BMI'].head()

0    33.6
1    26.6
2    23.3
3    28.1
4    43.1
Name: BMI, dtype: float64

In [ ]:
#i want read the 1st row value of BMI
df['BMI'][0]

np.float64(33.6)

In [ ]:
#locating the rows
#in pandas we locate rows by using "df.loc"
#df.loc[index]
df.loc[0]
#i want to print a range of rows from 100 to 200
#df.loc[start_rowindex:end_row_index]
df.loc[100:200]

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class
100,1,163.0,72.0,NaN,NaN,39.0,1.222,33,1
101,1,151.0,60.0,NaN,NaN,26.1,0.179,22,0
102,0,125.0,96.0,NaN,NaN,22.5,0.262,21,0
103,1,81.0,72.0,18.0,40.0,26.6,0.283,24,0
104,2,85.0,65.0,NaN,NaN,39.6,0.930,27,0
...,...,...,...,...,...,...,...,...,...
196,1,105.0,58.0,NaN,NaN,24.3,0.187,21,0
197,3,107.0,62.0,13.0,48.0,22.9,0.678,23,1
198,4,109.0,64.0,44.0,99.0,34.8,0.905,26,1
199,4,148.0,60.0,27.0,318.0,30.9,0.150,29,1
200,0,113.0,80.0,16.0,NaN,31.0,0.874,21,0

In [ ]:
#i want to read the rows of even index position
#df.loc[start:end:step]
df.loc[::2] #locate the even rows and locate the odd rows

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1
2,8,183.0,64.0,NaN,NaN,23.3,0.672,32,1
4,0,137.0,40.0,35.0,168.0,43.1,2.288,33,1
6,3,78.0,50.0,32.0,88.0,31.0,0.248,26,1
8,2,197.0,70.0,45.0,543.0,30.5,0.158,53,1
...,...,...,...,...,...,...,...,...,...
758,1,106.0,76.0,NaN,NaN,37.5,0.197,26,0
760,2,88.0,58.0,26.0,16.0,28.4,0.766,22,0
762,9,89.0,62.0,NaN,NaN,22.5,0.142,33,0
764,2,122.0,70.0,27.0,NaN,36.8,0.340,27,0
766,1,126.0,60.0,NaN,NaN,30.1,0.349,47,1

In [ ]:
df.loc[1::2] #locate odd rows

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class
1,1,85.0,66.0,29.0,NaN,26.6,0.351,31,0
3,1,89.0,66.0,23.0,94.0,28.1,0.167,21,0
5,5,116.0,74.0,NaN,NaN,25.6,0.201,30,0
7,10,115.0,NaN,NaN,NaN,35.3,0.134,29,0
9,8,125.0,96.0,NaN,NaN,NaN,0.232,54,1
...,...,...,...,...,...,...,...,...,...
759,6,190.0,92.0,NaN,NaN,35.5,0.278,66,1
761,9,170.0,74.0,31.0,NaN,44.0,0.403,43,1
763,10,101.0,76.0,48.0,180.0,32.9,0.171,63,0
765,5,121.0,72.0,23.0,112.0,26.2,0.245,30,0
767,1,93.0,70.0,31.0,NaN,30.4,0.315,23,0

In [ ]:
#i want to display the even position data of a particular column--> 'Diastolic_BP'
#df.loc[start:end:step, column_name]
df.loc[::2,'Diastolic_BP']

0      72.0
2      64.0
4      40.0
6      50.0
8      70.0
       ...
758    76.0
760    58.0
762    62.0
764    70.0
766    60.0
Name: Diastolic_BP, Length: 384, dtype: float64

In [ ]:
#display the even index position character of multiple columns
df.loc[::2,['Diastolic_BP','BMI']]

     Diastolic_BP   BMI
0            72.0  33.6
2            64.0  23.3
4            40.0  43.1
6            50.0  31.0
8            70.0  30.5
..            ...   ...
758          76.0  37.5
760          58.0  28.4
762          62.0  22.5
764          70.0  36.8
766          60.0  30.1

[384 rows x 2 columns]

In [ ]:
#i want to locate rows with particular index numbers
df.loc[[23,45,67]]

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class
23,9,119.0,80.0,35.0,NaN,29.0,0.263,29,1
45,0,180.0,66.0,39.0,NaN,42.0,1.893,25,1
67,2,109.0,92.0,NaN,NaN,42.7,0.845,54,0

In [ ]:
#applying the conditions  at row level by using df.loc
#in 'Glucose' column print the even number data
df.loc[df['Glucose']%2 == 0]

,Pregnant,Glucose,Diastolic_BP,Skin_Fold,Serum_Insulin,BMI,Diabetes_Pedigree,Age,Class
0,6,148.0,72.0,35.0,NaN,33.6,0.627,50,1
5,5,116.0,74.0,NaN,NaN,25.6,0.201,30,0
6,3,78.0,50.0,32.0,88.0,31.0,0.248,26,1
10,4,110.0,92.0,NaN,NaN,37.6,0.191,30,0
11,10,168.0,74.0,NaN,NaN,38.0,0.537,34,1
...,...,...,...,...,...,...,...,...,...
759,6,190.0,92.0,NaN,NaN,35.5,0.278,66,1
760,2,88.0,58.0,26.0,16.0,28.4,0.766,22,0
761,9,170.0,74.0,31.0,NaN,44.0,0.403,43,1
764,2,122.0,70.0,27.0,NaN,36.8,0.340,27,0
766,1,126.0,60.0,NaN,NaN,30.1,0.349,47,1

In [ ]:
#df.iloc()
#iloc:- pass axis number  for particular row and column
#synatx:-  df.iloc[row_index, column_index]

In [ ]:
#locate first 3 rows and first 3 columns data in above df
df.iloc[0:3,0:3]

   Pregnant  Glucose  Diastolic_BP
0         6    148.0          72.0
1         1     85.0          66.0
2         8    183.0          64.0

In [ ]:
#print the pariculae value from specific row and specific column
df.iloc[11,2]

np.float64(74.0)

In [ ]:
df.iloc[1,2]

np.float64(66.0)

In [ ]:
df.iloc[6,6]

np.float64(0.248)

In [ ]:
#Note:- in 'df.loc' we can apply the conditions and in 'df.iloc' we cannot apply the conditions

In [ ]:
#find the number of duplicates in df
df.duplicated().sum()

np.int64(0)

In [ ]:
#how to drop duplicate data
df.drop_duplicates(inplace=True)

In [ ]:
#find the null vales
df.isnull().sum()

Pregnant               0
Glucose                5
Diastolic_BP          35
Skin_Fold            227
Serum_Insulin        374
BMI                   11
Diabetes_Pedigree      0
Age                    0
Class                  0
dtype: int64

In [ ]:
#find the unique values in 'BMI'
df['BMI'].unique()

array([33.6, 26.6, 23.3, 28.1, 43.1, 25.6, 31. , 35.3, 30.5,  nan, 37.6,
       38. , 27.1, 30.1, 25.8, 30. , 45.8, 29.6, 43.3, 34.6, 39.3, 35.4,
       39.8, 29. , 36.6, 31.1, 39.4, 23.2, 22.2, 34.1, 36. , 31.6, 24.8,
       19.9, 27.6, 24. , 33.2, 32.9, 38.2, 37.1, 34. , 40.2, 22.7, 45.4,
       27.4, 42. , 29.7, 28. , 39.1, 19.4, 24.2, 24.4, 33.7, 34.7, 23. ,
       37.7, 46.8, 40.5, 41.5, 25. , 25.4, 32.8, 32.5, 42.7, 19.6, 28.9,
       28.6, 43.4, 35.1, 32. , 24.7, 32.6, 43.2, 22.4, 29.3, 24.6, 48.8,
       32.4, 38.5, 26.5, 19.1, 46.7, 23.8, 33.9, 20.4, 28.7, 49.7, 39. ,
       26.1, 22.5, 39.6, 29.5, 34.3, 37.4, 33.3, 31.2, 28.2, 53.2, 34.2,
       26.8, 55. , 42.9, 34.5, 27.9, 38.3, 21.1, 33.8, 30.8, 36.9, 39.5,
       27.3, 21.9, 40.6, 47.9, 50. , 25.2, 40.9, 37.2, 44.2, 29.9, 31.9,
       28.4, 43.5, 32.7, 67.1, 45. , 34.9, 27.7, 35.9, 22.6, 33.1, 30.4,
       52.3, 24.3, 22.9, 34.8, 30.9, 40.1, 23.9, 37.5, 35.5, 42.8, 42.6,
       41.8, 35.8, 37.8, 28.8, 23.6, 35.7, 36.7, 45.2, 44. , 46.2, 35. ,
       43.6, 44.1, 18.4, 29.2, 25.9, 32.1, 36.3, 40. , 25.1, 27.5, 45.6,
       27.8, 24.9, 25.3, 37.9, 27. , 26. , 38.7, 20.8, 36.1, 30.7, 32.3,
       52.9, 21. , 39.7, 25.5, 26.2, 19.3, 38.1, 23.5, 45.5, 23.1, 39.9,
       36.8, 21.8, 41. , 42.2, 34.4, 27.2, 36.5, 29.8, 39.2, 38.4, 36.2,
       48.3, 20. , 22.3, 45.7, 23.7, 22.1, 42.1, 42.4, 18.2, 26.4, 45.3,
       37. , 24.5, 32.2, 59.4, 21.2, 26.7, 30.2, 46.1, 41.3, 38.8, 35.2,
       42.3, 40.7, 46.5, 33.5, 37.3, 30.3, 26.3, 21.7, 36.4, 28.5, 26.9,
       38.6, 31.3, 19.5, 20.1, 40.8, 23.4, 28.3, 38.9, 57.3, 35.6, 49.6,
       44.6, 24.1, 44.5, 41.2, 49.3, 46.3])

In [ ]:
#count values in a particular column of df
df['BMI'].value_counts()

BMI
32.0    13
31.2    12
31.6    12
32.4    10
33.3    10
        ..
49.6     1
24.1     1
41.2     1
49.3     1
46.3     1
Name: count, Length: 247, dtype: int64

In [ ]:
#revision
#df.head()
#df.tail()
#df.dtypes
#df.shape
#df.size
#df.columns
#df.info()
#df.describe()
#df.isnull().sum()
#df.dropna()
#df.loc[]-->locate the rows
#df.iloc[]-->locate index and colums
#df.duplicated().sum()
#df.drop_duplicates()
#df['column_name'].unique()-->print the unique value in the particular column
#df['column_name'].value_counts()-->frequency of each value

# 23-01-2024

In [ ]:
# Applying the filters on the dataset
#How to apply filters on dataset?
#By using apply():- it takes a function as an argument and apply it each item in dataset
#df.apply(function,convert_dtype = True)

In [ ]:
l =[1,2,3,4,5,6,7,8,9]
def check_eve(num):
    if num%2==0:
        return True
    else:
        return False

False

In [ ]:
a = list(filter(check_eve,l))
print(a)

[2, 4, 6, 8]

In [ ]:
d = {
    'name' : ['a','b','c','d','e'],
    'marks':[56,70,40,80,90]
}
#convert the above dictionary in to df
import pandas as pd
df = pd.DataFrame(d)
print(df)

  name  marks
0    a     56
1    b     70
2    c     40
3    d     80
4    e     90

In [ ]:
#create a function so it print pass or fail pass marks can be 50
def check_pass_fail(marks):
    if marks >=50:
        return 'Pass'
    else:
        return 'Fail'

In [ ]:
#df.apply(function)
df['marks'].apply(check_pass_fail)
#Note:- apply() takes a function as an argument and apply it to a particular column of df

0    Pass
1    Pass
2    Fail
3    Pass
4    Pass
Name: marks, dtype: object

In [ ]:
#map():- it is used replace a the old data in column with new data
#Note:- the has to be in dictionary or series
#syntax:- old_df['column_name'].map('dictionary or series name')
data = {
    'Grades':['A','B','C','D','E']
}
df = pd.DataFrame(data)
df

  Grades
0      A
1      B
2      C
3      D
4      E

In [ ]:
grades = {'A':'excellent','B':'good','C':'Fair','D':'pass','E':'Fail'}
df['Grades'] = df['Grades'].map(grades)
df

      Grades
0  excellent
1       good
2       Fair
3       pass
4       Fail

In [ ]:
#Time series

In [ ]:
#what is time series data?
"""time series data is a sequence of of data pointsin cronological order that is used by business
to analyze the past data and make the future prediction"""
#ex:- weather forecast
#no of taxi rides in a month
#prediciting a company stock price for the next day

In [ ]:
#components of the time series
#it consist of 4 components
#1.Trend component:- this is a varaiation that moves up or down in a predictible pattern
#2.seasonality component:- the varaiation that is regular or periodic and it repeats cycles at regular periods or time
    #ex:- such as day,weeks,month or season
#3.cyclic components:- it is a varaiation that corresponds to business where you can see "boom-bust" cycles
#4.irregular components:- also known as random components